// NumOfDigits.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <stdlib.h>
#include <math.h>

int main()
{
    int iNum, iVal, iNumDigits;
    system("cls");
    std::cout << "Input an integer number\r\n";
    std::cin >> iNum;
    iVal = abs(iNum); iNumDigits = 0;
    while (iVal > 0)
    {
        iVal /= 10;
        iNumDigits++;
    }
    std::cout << "The number " << iNum << " has " << iNumDigits << " digit(s)\r\n";
    std::cin.ignore();
    std::cin.get();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
